Repository: intel-hpdd/intel-manager-for-lustre
Catalog: cluster-sim/cluster_sim/locale/*/LC_MESSAGE/cluster_sim.po
Languages: ru

source: Error %s sampling %s
ru: Ошибка %s семплирования %s

source: %.40s: No data
ru: %.40s: нет данных

source: RabbitMQ queue lengths: (avg, min, max)
ru: Длины очередей RabbitMQ: (сред, мин, макс)

source: simulator_controller plugin not enabled on manager at %s
ru: Плагин simulator_controller не включен на менеджере у %s

source: Resetting
ru: Сбрасывается

source: Starting %s:
ru: Запускается %s:

source: Ran in %.0fs
ru: Отработало за %.0fс

source: API latencies:
ru: Задержки API:

source: Command failed: %s
ru: Отказ команды: %s

source: Timeout on %s
ru: Истекло время ожидания на %s

source: Benchmark clearing %s
ru: Очистка испытательного замера %s

source: Failed to open session
ru: Отказ открытия сессии

source: Failed to authenticate
ru: Отказ аутентикации

source: Connection count initially: %s
ru: Начальное количество соединений: %s

source: Creating servers...
ru: Создаю серверы...

source: Registering servers...
ru: Регистрирую серверы...

source: Waiting for setup...
ru: Жду настройки...

source: Setup commands for %s servers
ru: Команды настройки для серверов %s

source: Failed registering %s servers: %s
ru: Отказ регистрации серверов %s: %s

source: Connection count: %s
ru: Количество соединений: %s

source: Requesting filesystem creation...
ru: Запрашиваю создание ФС...

source: Filesystem creation POST (%d OSTs)
ru: POST на создание ФС (%d OST)

source: Awaiting filesystem creation...
ru: Жду создания ФС...

source: Success for n = %s
ru: Всё хорошо для n = %s

source: Success registering %s servers
ru: Удачно зарегистрированы серверы %s

source: Connection count after flush: %s
ru: Соединений после flush: %s

source: i = %s, adding %s servers
ru: i = %s, добавляю %s серверов

source: Queue %s is backed up (%s-%s>%s in=%.2f out=%.2f)
ru: Очередь %s резервируется (%s-%s>%s вход=%.2f выход=%.2f)

source: Initially DB contains %s log messages
ru: Изначально БД содержит %s сообщений протокола

source: Stayed backed up for %s iterations, breaking
ru: Резервируется уже %s проходов, прерываем

source: Stopping log generation
ru: Останавливаю генерацию протокола

source: Waiting for queue to drain
ru: Жду очистки очереди

source: Finish draining
ru: Закончил очистку

source: Simulated benchmarks
ru: Измерения симуляции

source: Disable built-in simulator (run it separately)
ru: Отключить встроенный симулятор (запустить отдельно)

source: Enable DEBUG-level logs
ru: Включить протоколирование уровня DEBUG

source: Manager URL
ru: URL менеджера

source: REST API username
ru: Имя для REST API

source: REST API password
ru: Пароль для REST API

source: server count
ru: Количество серверов

source: Starting simulator...
ru: Запускаю симулятор...

source: Enabled agent logging within simulator
ru: Включено протоколирование агента в симуляторе

source: Starting benchmark...
ru: Запускаю измерения...

source: Complete.
ru: Готово.

source: Listening on %s
ru: Слушаю %s

source: Setting up simulator configuration for %s servers in %s/
ru: Настраиваю конфигурацию симулятора для %s серверов в %s/

source: No such profile: %s
ru: Нет такого профиля: %s

source: Must pass either --secret or --username and --password
ru: Надо указать либо --secret, либо --username и --password

source: Registering %s servers in %s/
ru: Реристрация %s серверов в %s/

source: Username and password required to create PDU entries
ru: Для создания элементов РЩП нужны имя и пароль

source: Creating PDU entries and associating PDU outlets with servers...
ru: Создаю элементы РЩП и соединяю их розетки с серверами...

source: Skipping PDU creation (no servers)
ru: Пропускаю создание РЩП (нет серверов)

source: Created power_control_type: %s
ru: Создал power_control_type: %s

source: Created power_control_device: %s
ru: Создал power_control_device: %s

source: Created association %s <=> %s:%s
ru: Создал ассоциацию %s <=> %s:%s

source: Running %s servers in %s/
ru: Выполняю %s серверов в %s/

source: Warning: Using proxy %s from https_proxy
ru: Осторожно! Используется прокси %s из https_proxy

source: Cluster simulator
ru: Симулятор кластера

source: Simulator configuration/state directory
ru: Каталог конфигурации/состояния симулятора

source: Servers per SU
ru: Серверов на корзину

source: Number of simulated storage servers
ru: Количество симулируемых серверов хранения

source: Number of simulated HSM workers
ru: Количество симулируемых рабочих потоков HSM

source: Number of LNet NIDs per storage server, defaults to 1 per server
ru: Количество NIDов LNet на сервер хранения (по умолчанию 1 на сервер)

source: Number of simulated storage devices, defaults to twice the number of servers
ru: Количество симулируемых устройств хранения (по умолчанию в два раза больше, чем серверов)

source: Number of simulated server Power Supply Units, defaults to one per server
ru: Количество симулируемых серверных БП (по умолчанию один на сервер)

source: Provide a secret for registration, or provide API credentials for the simulator to acquire a token itself
ru: Предоставьте либо "секрет" для регистрации, либо регистрационные данные API, чтобы симулятор сам получил нужный жетон

source: Registration token secret
ru: Секретный жетон для регистрации

source: API username
ru: Имя в API

source: API password
ru: Пароль в API

source: Create PDU entries on the manager
ru: Создать элементы РЩП на менеджере

source: Running indefinitely.
ru: Исполняется неопределённо.

source: Stopping...
ru: Останавливаюсь...

source: Cluster Power Control
ru: Управление питанием кластера

source: PDU name
ru: Наименование РЩП

source: PDU outlet number
ru: Номер розетки РЩП

source: Action to be performed (off|on|reboot)
ru: Что надо сделать (off - выключить|on - включить|reboot - перегрузить)

source: Server FQDN
ru: Полное доменное имя сервера

source: Unknown command %s
ru: Неизвестная команда %s

source: Multiple mounts on %s: %s
ru: Множественное монтирование на %s: %s

source: Tried to read proc on client %s but nothing is mounted
ru: Хотел прочитать proc на клиенте %s, но ничего не смонтировано

source: mgsnode %s not found (known mgts are %s)
ru: Не найден узел MGS %s (известные MGSы %s)

source: Starting resource %s on %s
ru: Запускается ресурс %s на %s

source: leave: %s
ru: покинуть: %s

source: migrating %s to %s
ru: мигрирую %s на %s

source: stopping %s
ru: останавливаю %s

source: Starting %s on primary %s
ru: Запускаю %s на первичном %s

source: Starting %s on secondary %s
ru: Запускаю %s на вторичном %s

source: A lun with serial '%s' already exists
ru: Какой-то LUN с серийным номером '%s' уже есть

source: Lustre: Cluster simulator systemd_journal session start %s %s
ru: Lustre: Старт сессии systemd_journal для симулятора кластера %s %s

source: cluster nodes: %s
ru: узлы кластера: %s

source: Nodes and state: %s
ru: Узлы и состояния: %s

source: Tried to format a local filesystem somewhere we already have a lustre target
ru: Пытался форматировать локальную ФС где-то, где уже есть некий том Lustre

source: Took %s from unassigned: %d
ru: Взял %s из нераспределённого: %d

source: Got random action: %s
ru: Получил случайное действие: %s

source: Received duplicate start request %s for %s
ru: Получен дубликат запроса на запуск %s для %s

source: Received finish request %s for unknown action on %s
ru: Получен запрос завершения %s для неизвестного действия на %s

source: Culled %d completed requests
ru: Отбраковано %d завершённых запросов

source: Coordinator thread for %s stopping
ru: Останавливается поток координатора для %s

source: Coordinator thread for %s starting: %s
ru: Запускается поток координатора для %s: %s

source: Cannot find unknown agent by id: %s
ru: Не могу найти неизвестного агента по идентификатору: %s

source: Deregistering existing agent with id %s
ru: Отмена регистрации существующего агента с идентификатором %s

source: Registered agent: %s (%s)
ru: Зарегистрирован агент: %s (%s)

source: Deregistered agent: %s
ru: Отменена регистрация агента: %s

source: Got start on %s from %s
ru: Запустился на %s из %s

source: Got finish on %s from %s
ru: Закончил на %s из %s

source: Unknown HSM Coordinator control value: %s
ru: Неизвестное управляющее значение Координатора HSM: %s

source: Starting HSM Coordinator for %s
ru: Запускаю Координатора HSM для %s

source: Stopping HSM Coordinator for %s
ru: Останавливаю Координатора HSM для %s

source: Opened %s for write
ru: Открыл %s на запись

source: Copytool %s started
ru: Запустился копировальщик %s

source: Attempt to start unregistered copytool: %s
ru: Попытка апустить незарегистрированный копировальщик: %s

source: Starting HSM Copytool: %s
ru: Запускаю копировальщик HSM: %s

source: Timed out waiting for copytool thread to start
ru: Истекло время ожидания запуска потока копировальщика

source: Stopping HSM Copytool: %s
ru: Останавливаю Копировальщик HSM: %s

source: Handling PDU request from %s:%s
ru: Обрабатываю запрос РЩП от %s:%s

source: Creating PDU server for %s on %s:%s
ru: Создаю сервер РЩП для %s на %s:%s

source: %s: received connection from %s:%s
ru: %s: получил соединение от %s:%s

source: POWER: Toggled %s:%s to %s
ru: ПИТАНИЕ: Переключил %s:%s в %s

source: %s: client %s:%s disconnected
ru: %s: клиент %s:%s отвалился

source: Unhandled response in %s: '%s' (%s)
ru: Необработанный ответ в %s: '%s' (%s)

source: Received username: %s
ru: Получил имя: %s

source: Received password: %s
ru: Получил пароль: %s

source: ------- Control Console ------------------------------------------------------- 1- Device Manager 2- Network 3- System 4- Logout <ESC>- Main Menu, <ENTER>- Refresh, <CTRL-L>- Event Log >
ru: ------- Control Console -- Консоль управления --------------------------------- 1- Device Manager -- Менеджер устройств 2- Network -- Сеть 3- System -- Система 4- Logout -- Выход <ESC>- Main Menu, <ENTER>- Refresh, <CTRL-L>- Event Log - Верх меню - Обновить - Протокол >

source: ------- Device Manager -------------------------------------------------------- 1- Phase Management 2- Outlet Management 3- Power Supply Status <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log >
ru: ------- Device Manager -- Менеджер устройств ---------------------------------- 1- Phase Management -- Управление фазой 2- Outlet Management -- Управление розеткой 3- Power Supply Status -- Состояние БП <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log - Назад - Обновить - Протокол >

source: ------- Outlet Management ----------------------------------------------------- 1- Outlet Control/Configuration 2- Outlet Restriction <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log >
ru: ------- Outlet Management -- Управление розеткой ------------------------------ 1- Outlet Control/Configuration -- Управление/конфигурация розетки 2- Outlet Restriction -- Ограничения розетки <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log - Назад - Обновить - Протокол >

source: ------- Outlet Control/Configuration ------------------------------------------ %s <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log >
ru: ------- Outlet Control/Configuration -- Управление/конфигурация розетки ------- %s <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log - Назад - Обновить - Протокол >

source: ------- Outlet %s ------------------------------------------------------------- Name : Outlet %s Outlet : %s State : %s 1- Control Outlet 2- Configure Outlet ?- Help, <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log >
ru: ------- Outlet %s -- Розетка -------------------------------------------------- Name Имя : Outlet %s Outlet Розетка : %s State Состояние : %s 1- Control Outlet -- Управлять розетку 2- Configure Outlet -- Конфигурировать розетку ?- Help, <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log - Помощь - Назад - Обновить - Протокол >

source: ------- Control Outlet -------------------------------------------------------- Name : Outlet %s Outlet : %s State : %s 1- Immediate On 2- Immediate Off 3- Immediate Reboot 4- Delayed On 5- Delayed Off 6- Delayed Reboot 7- Cancel ?- Help, <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log >
ru: ------- Control Outlet -- Управлять розеткой ---------------------------------- Name Имя : Outlet %s Outlet Розетка : %s State Состояние : %s 1- Immediate On -- Немедленное включение 2- Immediate Off -- Немедленное отключение 3- Immediate Reboot -- Немедленная перезагрузка 4- Delayed On -- Отложенное включение 5- Delayed Off -- Отложенное отключение 6- Delayed Reboot -- Отложенная перезагрузка 7- Cancel -- Отмена ?- Help, <ESC>- Back, <ENTER>- Refresh, <CTRL-L>- Event Log - Помощь - Назад - Обновить - Протокол >

source: ----------------------------------------------------------------------- I'm too lazy to go through all the various permutations. The key line expected by fence_apc is the next one: Enter 'YES' to continue or <ENTER> to cancel :
ru: ----------------------------------------------------------------------- Я слишком ленив, чтобы продираться через всевозможные перестановки. Нужная строчка, которую ждёт fence_apc, вот эта: Введите 'YES', чтобы продолжить или <ENTER>, чтобы отменить:

source: %sCommand successfully issued.
ru: Команда успешно введена.

source: %sPress <ENTER> to continue...
ru: %sНажмите <ENTER> для продолжения...

source: Connection Closed - Bye
ru: Соединение закрыто - до свидания

source: Client %s:%s logged out
ru: Клиент %s:%s вышел

source: %s: Running %s -> %s on %s:%s
ru: %s: Выполняю %s -> %s на %s:%s

source: stopping %s in poweroff_hook
ru: останавливаю %s в poweroff_hook

source: starting %s in poweron_hook
ru: запускаю %s в poweron_hook

source: Hello world
ru: Здравствуй, мир!
